# -*- encoding: utf-8 -*-
# python 3.12
# zerojudge b515
# 103學年度商業類程式設計競賽模擬題


morse_key = {
    ".-": "A", "-...": "B", "-.-.": "C", "-..": "D", ".": "E",
    "..-.": "F", "--.": "G", "....": "H", "..": "I", ".---": "J",
    "-.-": "K", ".-..": "L", "--": "M", "-.": "N", "---": "O",
    ".--.": "P", "--.-": "Q", ".-.": "R", "...": "S", "-": "T",
    "..-": "U", "...-": "V", ".--": "W", "-..-": "X", "-.--": "Y",
    "--..": "Z"
}

for _ in range(int(input())):
    morse = input().rstrip().split()
    print(''.join(morse_key[i] for i in morse))
